; ModuleID = 'sscanf'
source_filename = "sscanf"

@fmt = private unnamed_addr constant [5 x i8] c"%i%n\00", align 1
@fmt.1 = private unnamed_addr constant [5 x i8] c"0x%x\00", align 1

; Function Attrs: nofree nounwind
declare i32 @sscanf(i8* nocapture readonly, i8* nocapture readonly, ...) local_unnamed_addr #0

; Function Attrs: nofree nounwind
define i32 @reader0(i8* nocapture readonly, i32*) local_unnamed_addr #0 {
  %3 = alloca i32, align 4
  store i32 0, i32* %3, align 4
  %4 = tail call i32 (i8*, i8*, ...) @sscanf(i8* %0, i8* getelementptr inbounds ([5 x i8], [5 x i8]* @fmt, i64 0, i64 0), i32* %1, i32* nonnull %3)
  %5 = icmp eq i32 %4, 1
  br i1 %5, label %7, label %6

6:                                                ; preds = %2
  ret i32 -1

7:                                                ; preds = %2
  %8 = load volatile i32, i32* %3, align 4
  ret i32 0
}

; Function Attrs: nofree nounwind
define i32 @writer0(i8* nocapture, i64, i32* nocapture readonly) local_unnamed_addr #0 {
  %4 = load i32, i32* %2, align 4
  %5 = tail call i32 (i8*, i64, i8*, ...) @snprintf(i8* %0, i64 %1, i8* getelementptr inbounds ([5 x i8], [5 x i8]* @fmt.1, i64 0, i64 0), i32 %4)
  ret i32 %5
}

; Function Attrs: nofree nounwind
declare i32 @snprintf(i8* nocapture, i64, i8* nocapture readonly, ...) local_unnamed_addr #0

attributes #0 = { nofree nounwind }
; ModuleID = '/virtual/main.c'
source_filename = "/virtual/main.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_version", scope: !2, file: !1480, line: 285, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1-8build1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !24, globals: !1457, nameTableKind: None)
!3 = !DIFile(filename: "/virtual/main.c", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!4 = !{!5, !11, !17}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hrtimer_restart", file: !6, line: 64, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "include/linux/hrtimer.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "HRTIMER_NORESTART", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "HRTIMER_RESTART", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "timespec_type", file: !12, line: 16, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "include/linux/restart_block.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!13 = !{!14, !15, !16}
!14 = !DIEnumerator(name: "TT_NONE", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "TT_NATIVE", value: 1, isUnsigned: true)
!16 = !DIEnumerator(name: "TT_COMPAT", value: 2, isUnsigned: true)
!17 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uprobe_task_state", file: !18, line: 51, baseType: !7, size: 32, elements: !19)
!18 = !DIFile(filename: "include/linux/uprobes.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!19 = !{!20, !21, !22, !23}
!20 = !DIEnumerator(name: "UTASK_RUNNING", value: 0, isUnsigned: true)
!21 = !DIEnumerator(name: "UTASK_SSTEP", value: 1, isUnsigned: true)
!22 = !DIEnumerator(name: "UTASK_SSTEP_ACK", value: 2, isUnsigned: true)
!23 = !DIEnumerator(name: "UTASK_SSTEP_TRAPPED", value: 3, isUnsigned: true)
!24 = !{!25, !30, !31, !1455}
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !26, line: 23, baseType: !27)
!26 = !DIFile(filename: "include/asm-generic/int-ll64.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !28, line: 31, baseType: !29)
!28 = !DIFile(filename: "include/uapi/asm-generic/int-ll64.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!29 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_struct", file: !33, line: 624, size: 73728, elements: !34)
!33 = !DIFile(filename: "include/linux/sched.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!34 = !{!35, !44, !47, !48, !60, !61, !62, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !84, !169, !181, !184, !307, !317, !318, !328, !329, !330, !331, !342, !343, !344, !345, !346, !347, !348, !355, !356, !363, !364, !608, !609, !615, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !698, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !739, !741, !742, !743, !745, !747, !748, !749, !750, !751, !757, !758, !759, !760, !761, !762, !763, !777, !781, !782, !783, !786, !791, !794, !801, !806, !807, !808, !811, !814, !817, !820, !823, !830, !831, !832, !838, !839, !843, !844, !845, !848, !855, !856, !864, !865, !866, !867, !868, !873, !874, !875, !878, !879, !882, !885, !888, !891, !894, !897, !898, !978, !989, !990, !991, !992, !993, !1000, !1001, !1002, !1003, !1006, !1007, !1008, !1009, !1012, !1015, !1016, !1019, !1020, !1021, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1042, !1044, !1045, !1047, !1048, !1061, !1062, !1063, !1073, !1078, !1081, !1181, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1202, !1203, !1204, !1205, !1208, !1247, !1248, !1249, !1250, !1251, !1268, !1269, !1270, !1271}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "thread_info", scope: !32, file: !33, line: 630, baseType: !36, size: 128)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_info", file: !37, line: 56, size: 128, elements: !38)
!37 = !DIFile(filename: "./arch/x86/include/asm/thread_info.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!38 = !{!39, !41}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !37, line: 57, baseType: !40, size: 64)
!40 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !36, file: !37, line: 58, baseType: !42, size: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !26, line: 21, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !28, line: 27, baseType: !7)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !32, file: !33, line: 633, baseType: !45, size: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !46)
!46 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !32, file: !33, line: 641, baseType: !30, size: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !32, file: !33, line: 642, baseType: !49, size: 32, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "refcount_t", file: !50, line: 21, baseType: !51)
!50 = !DIFile(filename: "include/linux/refcount.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "refcount_struct", file: !50, line: 19, size: 32, elements: !52)
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !51, file: !50, line: 20, baseType: !54, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !55, line: 173, baseType: !56)
!55 = !DIFile(filename: "include/linux/types.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 171, size: 32, elements: !57)
!57 = !{!58}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !56, file: !55, line: 172, baseType: !59, size: 32)
!59 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !32, file: !33, line: 644, baseType: !7, size: 32, offset: 288)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace", scope: !32, file: !33, line: 645, baseType: !7, size: 32, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "wake_entry", scope: !32, file: !33, line: 648, baseType: !63, size: 64, offset: 384)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "llist_node", file: !64, line: 58, size: 64, elements: !65)
!64 = !DIFile(filename: "include/linux/llist.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !63, file: !64, line: 59, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "on_cpu", scope: !32, file: !33, line: 649, baseType: !59, size: 32, offset: 448)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !32, file: !33, line: 652, baseType: !7, size: 32, offset: 480)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "wakee_flips", scope: !32, file: !33, line: 654, baseType: !7, size: 32, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "wakee_flip_decay_ts", scope: !32, file: !33, line: 655, baseType: !40, size: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "last_wakee", scope: !32, file: !33, line: 656, baseType: !31, size: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "recent_used_cpu", scope: !32, file: !33, line: 665, baseType: !59, size: 32, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "wake_cpu", scope: !32, file: !33, line: 666, baseType: !59, size: 32, offset: 736)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !32, file: !33, line: 668, baseType: !59, size: 32, offset: 768)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !32, file: !33, line: 670, baseType: !59, size: 32, offset: 800)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "static_prio", scope: !32, file: !33, line: 671, baseType: !59, size: 32, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "normal_prio", scope: !32, file: !33, line: 672, baseType: !59, size: 32, offset: 864)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "rt_priority", scope: !32, file: !33, line: 673, baseType: !7, size: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "sched_class", scope: !32, file: !33, line: 675, baseType: !81, size: 64, offset: 960)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_class", file: !33, line: 675, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "se", scope: !32, file: !33, line: 676, baseType: !85, size: 3584, offset: 1024)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_entity", file: !33, line: 444, size: 3584, elements: !86)
!86 = !{!87, !92, !93, !101, !107, !108, !109, !110, !111, !112, !113, !146, !147, !149, !152, !153}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "load", scope: !85, file: !33, line: 446, baseType: !88, size: 128)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "load_weight", file: !33, line: 320, size: 128, elements: !89)
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !88, file: !33, line: 321, baseType: !40, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "inv_weight", scope: !88, file: !33, line: 322, baseType: !42, size: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "runnable_weight", scope: !85, file: !33, line: 447, baseType: !40, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "run_node", scope: !85, file: !33, line: 448, baseType: !94, size: 192, align: 64, offset: 192)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_node", file: !95, line: 24, size: 192, align: 64, elements: !96)
!95 = !DIFile(filename: "include/linux/rbtree.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!96 = !{!97, !98, !100}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__rb_parent_color", scope: !94, file: !95, line: 25, baseType: !40, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "rb_right", scope: !94, file: !95, line: 26, baseType: !99, size: 64, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "rb_left", scope: !94, file: !95, line: 27, baseType: !99, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "group_node", scope: !85, file: !33, line: 449, baseType: !102, size: 128, offset: 384)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !55, line: 181, size: 128, elements: !103)
!103 = !{!104, !106}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !102, file: !55, line: 182, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !102, file: !55, line: 182, baseType: !105, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !85, file: !33, line: 450, baseType: !7, size: 32, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "exec_start", scope: !85, file: !33, line: 452, baseType: !25, size: 64, offset: 576)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sum_exec_runtime", scope: !85, file: !33, line: 453, baseType: !25, size: 64, offset: 640)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "vruntime", scope: !85, file: !33, line: 454, baseType: !25, size: 64, offset: 704)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "prev_sum_exec_runtime", scope: !85, file: !33, line: 455, baseType: !25, size: 64, offset: 768)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations", scope: !85, file: !33, line: 457, baseType: !25, size: 64, offset: 832)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "statistics", scope: !85, file: !33, line: 459, baseType: !114, size: 1728, offset: 896)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_statistics", file: !33, line: 408, size: 1728, elements: !115)
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !124, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "wait_start", scope: !114, file: !33, line: 410, baseType: !25, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "wait_max", scope: !114, file: !33, line: 411, baseType: !25, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "wait_count", scope: !114, file: !33, line: 412, baseType: !25, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "wait_sum", scope: !114, file: !33, line: 413, baseType: !25, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "iowait_count", scope: !114, file: !33, line: 414, baseType: !25, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "iowait_sum", scope: !114, file: !33, line: 415, baseType: !25, size: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_start", scope: !114, file: !33, line: 417, baseType: !25, size: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "sleep_max", scope: !114, file: !33, line: 418, baseType: !25, size: 64, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "sum_sleep_runtime", scope: !114, file: !33, line: 419, baseType: !125, size: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "s64", file: !26, line: 22, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !28, line: 30, baseType: !127)
!127 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "block_start", scope: !114, file: !33, line: 421, baseType: !25, size: 64, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "block_max", scope: !114, file: !33, line: 422, baseType: !25, size: 64, offset: 640)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "exec_max", scope: !114, file: !33, line: 423, baseType: !25, size: 64, offset: 704)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "slice_max", scope: !114, file: !33, line: 424, baseType: !25, size: 64, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "nr_migrations_cold", scope: !114, file: !33, line: 426, baseType: !25, size: 64, offset: 832)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_affine", scope: !114, file: !33, line: 427, baseType: !25, size: 64, offset: 896)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_running", scope: !114, file: !33, line: 428, baseType: !25, size: 64, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "nr_failed_migrations_hot", scope: !114, file: !33, line: 429, baseType: !25, size: 64, offset: 1024)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "nr_forced_migrations", scope: !114, file: !33, line: 430, baseType: !25, size: 64, offset: 1088)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups", scope: !114, file: !33, line: 432, baseType: !25, size: 64, offset: 1152)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_sync", scope: !114, file: !33, line: 433, baseType: !25, size: 64, offset: 1216)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_migrate", scope: !114, file: !33, line: 434, baseType: !25, size: 64, offset: 1280)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_local", scope: !114, file: !33, line: 435, baseType: !25, size: 64, offset: 1344)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_remote", scope: !114, file: !33, line: 436, baseType: !25, size: 64, offset: 1408)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_affine", scope: !114, file: !33, line: 437, baseType: !25, size: 64, offset: 1472)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_affine_attempts", scope: !114, file: !33, line: 438, baseType: !25, size: 64, offset: 1536)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_passive", scope: !114, file: !33, line: 439, baseType: !25, size: 64, offset: 1600)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nr_wakeups_idle", scope: !114, file: !33, line: 440, baseType: !25, size: 64, offset: 1664)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !85, file: !33, line: 462, baseType: !59, size: 32, offset: 2624)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !85, file: !33, line: 463, baseType: !148, size: 64, offset: 2688)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "cfs_rq", scope: !85, file: !33, line: 465, baseType: !150, size: 64, offset: 2752)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "cfs_rq", file: !33, line: 41, flags: DIFlagFwdDecl)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "my_q", scope: !85, file: !33, line: 467, baseType: !150, size: 64, offset: 2816)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "avg", scope: !85, file: !33, line: 477, baseType: !154, size: 512, align: 512, offset: 3072)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_avg", file: !33, line: 396, size: 512, align: 512, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "last_update_time", scope: !154, file: !33, line: 397, baseType: !25, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "load_sum", scope: !154, file: !33, line: 398, baseType: !25, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "runnable_load_sum", scope: !154, file: !33, line: 399, baseType: !25, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "util_sum", scope: !154, file: !33, line: 400, baseType: !42, size: 32, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "period_contrib", scope: !154, file: !33, line: 401, baseType: !42, size: 32, offset: 224)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "load_avg", scope: !154, file: !33, line: 402, baseType: !40, size: 64, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "runnable_load_avg", scope: !154, file: !33, line: 403, baseType: !40, size: 64, offset: 320)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "util_avg", scope: !154, file: !33, line: 404, baseType: !40, size: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "util_est", scope: !154, file: !33, line: 405, baseType: !165, size: 64, align: 64, offset: 448)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "util_est", file: !33, line: 347, size: 64, align: 64, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "enqueued", scope: !165, file: !33, line: 348, baseType: !7, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ewma", scope: !165, file: !33, line: 349, baseType: !7, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "rt", scope: !32, file: !33, line: 677, baseType: !170, size: 384, offset: 4608)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_rt_entity", file: !33, line: 481, size: 384, elements: !171)
!171 = !{!172, !173, !174, !175, !176, !178, !179}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "run_list", scope: !170, file: !33, line: 482, baseType: !102, size: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !170, file: !33, line: 483, baseType: !40, size: 64, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "watchdog_stamp", scope: !170, file: !33, line: 484, baseType: !40, size: 64, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "time_slice", scope: !170, file: !33, line: 485, baseType: !7, size: 32, offset: 256)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "on_rq", scope: !170, file: !33, line: 486, baseType: !177, size: 16, offset: 288)
!177 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "on_list", scope: !170, file: !33, line: 487, baseType: !177, size: 16, offset: 304)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "back", scope: !170, file: !33, line: 489, baseType: !180, size: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sched_task_group", scope: !32, file: !33, line: 679, baseType: !182, size: 64, offset: 4992)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "task_group", file: !33, line: 62, flags: DIFlagFwdDecl)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "dl", scope: !32, file: !33, line: 681, baseType: !185, size: 1728, offset: 5056)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_dl_entity", file: !33, line: 499, size: 1728, elements: !186)
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !306}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !185, file: !33, line: 500, baseType: !94, size: 192, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "dl_runtime", scope: !185, file: !33, line: 507, baseType: !25, size: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "dl_deadline", scope: !185, file: !33, line: 508, baseType: !25, size: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "dl_period", scope: !185, file: !33, line: 509, baseType: !25, size: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "dl_bw", scope: !185, file: !33, line: 510, baseType: !25, size: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "dl_density", scope: !185, file: !33, line: 511, baseType: !25, size: 64, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "runtime", scope: !185, file: !33, line: 518, baseType: !125, size: 64, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", scope: !185, file: !33, line: 519, baseType: !25, size: 64, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !185, file: !33, line: 520, baseType: !7, size: 32, offset: 640)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "dl_throttled", scope: !185, file: !33, line: 546, baseType: !7, size: 1, offset: 672, flags: DIFlagBitField, extraData: i64 672)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "dl_boosted", scope: !185, file: !33, line: 547, baseType: !7, size: 1, offset: 673, flags: DIFlagBitField, extraData: i64 672)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "dl_yielded", scope: !185, file: !33, line: 548, baseType: !7, size: 1, offset: 674, flags: DIFlagBitField, extraData: i64 672)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "dl_non_contending", scope: !185, file: !33, line: 549, baseType: !7, size: 1, offset: 675, flags: DIFlagBitField, extraData: i64 672)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "dl_overrun", scope: !185, file: !33, line: 550, baseType: !7, size: 1, offset: 676, flags: DIFlagBitField, extraData: i64 672)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "dl_timer", scope: !185, file: !33, line: 556, baseType: !202, size: 512, offset: 704)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer", file: !6, line: 117, size: 512, elements: !203)
!203 = !{!204, !212, !213, !218, !302, !303, !304, !305}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !202, file: !6, line: 118, baseType: !205, size: 256)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_node", file: !206, line: 9, size: 256, elements: !207)
!206 = !DIFile(filename: "include/linux/timerqueue.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !205, file: !206, line: 10, baseType: !94, size: 192, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !205, file: !206, line: 11, baseType: !210, size: 64, offset: 192)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "ktime_t", file: !211, line: 28, baseType: !125)
!211 = !DIFile(filename: "include/linux/ktime.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_softexpires", scope: !202, file: !6, line: 119, baseType: !210, size: 64, offset: 256)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "function", scope: !202, file: !6, line: 120, baseType: !214, size: 64, offset: 320)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!5, !217}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !202, file: !6, line: 121, baseType: !219, size: 64, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_clock_base", file: !6, line: 158, size: 512, align: 512, elements: !221)
!221 = !{!222, !274, !275, !279, !285, !286, !297, !301}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_base", scope: !220, file: !6, line: 159, baseType: !223, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hrtimer_cpu_base", file: !6, line: 213, size: 4608, align: 512, elements: !225)
!225 = !{!226, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !224, file: !6, line: 214, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "raw_spinlock_t", file: !228, line: 29, baseType: !229)
!228 = !DIFile(filename: "include/linux/spinlock_types.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "raw_spinlock", file: !228, line: 20, size: 32, elements: !230)
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "raw_lock", scope: !229, file: !228, line: 21, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "arch_spinlock_t", file: !233, line: 52, baseType: !234)
!233 = !DIFile(filename: "include/asm-generic/qspinlock_types.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qspinlock", file: !233, line: 22, size: 32, elements: !235)
!235 = !{!236}
!236 = !DIDerivedType(tag: DW_TAG_member, scope: !234, file: !233, line: 23, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !234, file: !233, line: 23, size: 32, elements: !238)
!238 = !{!239, !240, !248}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !237, file: !233, line: 24, baseType: !54, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, scope: !237, file: !233, line: 32, baseType: !241, size: 16)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !237, file: !233, line: 32, size: 16, elements: !242)
!242 = !{!243, !247}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "locked", scope: !241, file: !233, line: 33, baseType: !244, size: 8)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !26, line: 17, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !28, line: 21, baseType: !246)
!246 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !241, file: !233, line: 34, baseType: !244, size: 8, offset: 8)
!248 = !DIDerivedType(tag: DW_TAG_member, scope: !237, file: !233, line: 36, baseType: !249, size: 32)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !237, file: !233, line: 36, size: 32, elements: !250)
!250 = !{!251, !254}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "locked_pending", scope: !249, file: !233, line: 37, baseType: !252, size: 16)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "u16", file: !26, line: 19, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !28, line: 24, baseType: !177)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !249, file: !233, line: 38, baseType: !252, size: 16, offset: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !224, file: !6, line: 215, baseType: !7, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "active_bases", scope: !224, file: !6, line: 216, baseType: !7, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "clock_was_set_seq", scope: !224, file: !6, line: 217, baseType: !7, size: 32, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "hres_active", scope: !224, file: !6, line: 218, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "in_hrtirq", scope: !224, file: !6, line: 219, baseType: !7, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "hang_detected", scope: !224, file: !6, line: 220, baseType: !7, size: 1, offset: 130, flags: DIFlagBitField, extraData: i64 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_activated", scope: !224, file: !6, line: 221, baseType: !7, size: 1, offset: 131, flags: DIFlagBitField, extraData: i64 128)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nr_events", scope: !224, file: !6, line: 223, baseType: !7, size: 32, offset: 160)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nr_retries", scope: !224, file: !6, line: 224, baseType: !177, size: 16, offset: 192)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "nr_hangs", scope: !224, file: !6, line: 225, baseType: !177, size: 16, offset: 208)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "max_hang_time", scope: !224, file: !6, line: 226, baseType: !7, size: 32, offset: 224)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "expires_next", scope: !224, file: !6, line: 232, baseType: !210, size: 64, offset: 256)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "next_timer", scope: !224, file: !6, line: 233, baseType: !217, size: 64, offset: 320)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_expires_next", scope: !224, file: !6, line: 234, baseType: !210, size: 64, offset: 384)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "softirq_next_timer", scope: !224, file: !6, line: 235, baseType: !217, size: 64, offset: 448)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "clock_base", scope: !224, file: !6, line: 236, baseType: !271, size: 4096, offset: 512)
!271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !220, size: 4096, elements: !272)
!272 = !{!273}
!273 = !DISubrange(count: 8)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !220, file: !6, line: 160, baseType: !7, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !220, file: !6, line: 161, baseType: !276, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "clockid_t", file: !55, line: 27, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_clockid_t", file: !278, line: 93, baseType: !59)
!278 = !DIFile(filename: "./include/uapi/asm-generic/posix_types.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!279 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !220, file: !6, line: 162, baseType: !280, size: 32, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "seqcount_t", file: !281, line: 53, baseType: !282)
!281 = !DIFile(filename: "include/linux/seqlock.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seqcount", file: !281, line: 48, size: 32, elements: !283)
!283 = !{!284}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !282, file: !281, line: 49, baseType: !7, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "running", scope: !220, file: !6, line: 163, baseType: !217, size: 64, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !220, file: !6, line: 164, baseType: !287, size: 128, offset: 256)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timerqueue_head", file: !206, line: 14, size: 128, elements: !288)
!288 = !{!289}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !287, file: !206, line: 15, baseType: !290, size: 128)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root_cached", file: !95, line: 125, size: 128, elements: !291)
!291 = !{!292, !296}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "rb_root", scope: !290, file: !95, line: 126, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rb_root", file: !95, line: 31, size: 64, elements: !294)
!294 = !{!295}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "rb_node", scope: !293, file: !95, line: 32, baseType: !99, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "rb_leftmost", scope: !290, file: !95, line: 127, baseType: !99, size: 64, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "get_time", scope: !220, file: !6, line: 165, baseType: !298, size: 64, offset: 384)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DISubroutineType(types: !300)
!300 = !{!210}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !220, file: !6, line: 166, baseType: !210, size: 64, offset: 448)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !202, file: !6, line: 122, baseType: !244, size: 8, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "is_rel", scope: !202, file: !6, line: 123, baseType: !244, size: 8, offset: 456)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "is_soft", scope: !202, file: !6, line: 124, baseType: !244, size: 8, offset: 464)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "is_hard", scope: !202, file: !6, line: 125, baseType: !244, size: 8, offset: 472)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "inactive_timer", scope: !185, file: !33, line: 565, baseType: !202, size: 512, offset: 1216)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "uclamp_req", scope: !32, file: !33, line: 685, baseType: !308, size: 64, offset: 6784)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 64, elements: !315)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uclamp_se", file: !33, line: 595, size: 32, elements: !310)
!310 = !{!311, !312, !313, !314}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !309, file: !33, line: 596, baseType: !7, size: 11, flags: DIFlagBitField, extraData: i64 0)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "bucket_id", scope: !309, file: !33, line: 597, baseType: !7, size: 3, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !309, file: !33, line: 598, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "user_defined", scope: !309, file: !33, line: 599, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!315 = !{!316}
!316 = !DISubrange(count: 2)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "uclamp", scope: !32, file: !33, line: 687, baseType: !308, size: 64, offset: 6848)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_notifiers", scope: !32, file: !33, line: 692, baseType: !319, size: 64, offset: 6912)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_head", file: !55, line: 185, size: 64, elements: !320)
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !319, file: !55, line: 186, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hlist_node", file: !55, line: 189, size: 128, elements: !324)
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !323, file: !55, line: 190, baseType: !322, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pprev", scope: !323, file: !55, line: 190, baseType: !327, size: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "btrace_seq", scope: !32, file: !33, line: 696, baseType: !7, size: 32, offset: 6976)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !32, file: !33, line: 699, baseType: !7, size: 32, offset: 7008)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "nr_cpus_allowed", scope: !32, file: !33, line: 700, baseType: !59, size: 32, offset: 7040)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_ptr", scope: !32, file: !33, line: 701, baseType: !332, size: 64, offset: 7104)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpumask_t", file: !335, line: 17, baseType: !336)
!335 = !DIFile(filename: "include/linux/cpumask.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpumask", file: !335, line: 17, size: 8192, elements: !337)
!337 = !{!338}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !336, file: !335, line: 17, baseType: !339, size: 8192)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8192, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "cpus_mask", scope: !32, file: !33, line: 702, baseType: !334, size: 8192, offset: 7168)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_tasks_nvcsw", scope: !32, file: !33, line: 712, baseType: !40, size: 64, offset: 15360)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_tasks_holdout", scope: !32, file: !33, line: 713, baseType: !244, size: 8, offset: 15424)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_tasks_idx", scope: !32, file: !33, line: 714, baseType: !244, size: 8, offset: 15432)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_tasks_idle_cpu", scope: !32, file: !33, line: 715, baseType: !59, size: 32, offset: 15456)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "rcu_tasks_holdout_list", scope: !32, file: !33, line: 716, baseType: !102, size: 128, offset: 15488)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "sched_info", scope: !32, file: !33, line: 719, baseType: !349, size: 256, offset: 15616)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sched_info", file: !33, line: 285, size: 256, elements: !350)
!350 = !{!351, !352, !353, !354}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "pcount", scope: !349, file: !33, line: 290, baseType: !40, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "run_delay", scope: !349, file: !33, line: 293, baseType: !29, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "last_arrival", scope: !349, file: !33, line: 298, baseType: !29, size: 64, offset: 128)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "last_queued", scope: !349, file: !33, line: 301, baseType: !29, size: 64, offset: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !32, file: !33, line: 721, baseType: !102, size: 128, offset: 15872)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "pushable_tasks", scope: !32, file: !33, line: 723, baseType: !357, size: 320, offset: 16000)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plist_node", file: !358, line: 83, size: 320, elements: !359)
!358 = !DIFile(filename: "include/linux/plist.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!359 = !{!360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !357, file: !358, line: 84, baseType: !59, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "prio_list", scope: !357, file: !358, line: 85, baseType: !102, size: 128, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "node_list", scope: !357, file: !358, line: 86, baseType: !102, size: 128, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pushable_dl_tasks", scope: !32, file: !33, line: 724, baseType: !94, size: 192, align: 64, offset: 16320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "mm", scope: !32, file: !33, line: 727, baseType: !365, size: 64, offset: 16512)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_struct", file: !367, line: 372, size: 8256, elements: !368)
!367 = !DIFile(filename: "include/linux/mm_types.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!368 = !{!369, !604}
!369 = !DIDerivedType(tag: DW_TAG_member, scope: !366, file: !367, line: 373, baseType: !370, size: 8256)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !366, file: !367, line: 373, size: 8256, elements: !371)
!371 = !{!372, !427, !428, !429, !433, !434, !435, !436, !437, !438, !439, !446, !447, !448, !449, !450, !451, !459, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !498, !506, !509, !541, !542, !565, !566, !569, !570, !574, !575, !578, !579, !580, !581, !582, !585, !591, !592}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "mmap", scope: !370, file: !367, line: 374, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_area_struct", file: !367, line: 293, size: 1664, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381, !382, !383, !391, !392, !397, !398, !401, !405, !406, !409, !410, !411, !418, !421}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "vm_start", scope: !374, file: !367, line: 296, baseType: !40, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "vm_end", scope: !374, file: !367, line: 297, baseType: !40, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "vm_next", scope: !374, file: !367, line: 301, baseType: !373, size: 64, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prev", scope: !374, file: !367, line: 301, baseType: !373, size: 64, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "vm_rb", scope: !374, file: !367, line: 303, baseType: !94, size: 192, align: 64, offset: 256)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_gap", scope: !374, file: !367, line: 311, baseType: !40, size: 64, offset: 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "vm_mm", scope: !374, file: !367, line: 315, baseType: !365, size: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "vm_page_prot", scope: !374, file: !367, line: 316, baseType: !384, size: 64, offset: 576)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprot_t", file: !385, line: 266, baseType: !386)
!385 = !DIFile(filename: "./arch/x86/include/asm/pgtable_types.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pgprot", file: !385, line: 266, size: 64, elements: !387)
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pgprot", scope: !386, file: !385, line: 266, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgprotval_t", file: !390, line: 19, baseType: !40)
!390 = !DIFile(filename: "./arch/x86/include/asm/pgtable_64_types.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!391 = !DIDerivedType(tag: DW_TAG_member, name: "vm_flags", scope: !374, file: !367, line: 317, baseType: !40, size: 64, offset: 640)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !374, file: !367, line: 326, baseType: !393, size: 256, offset: 704)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !374, file: !367, line: 323, size: 256, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !393, file: !367, line: 324, baseType: !94, size: 192, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rb_subtree_last", scope: !393, file: !367, line: 325, baseType: !40, size: 64, offset: 192)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma_chain", scope: !374, file: !367, line: 334, baseType: !102, size: 128, offset: 960)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "anon_vma", scope: !374, file: !367, line: 336, baseType: !399, size: 64, offset: 1088)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "anon_vma", file: !367, line: 336, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "vm_ops", scope: !374, file: !367, line: 339, baseType: !402, size: 64, offset: 1152)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!404 = !DICompositeType(tag: DW_TAG_structure_type, name: "vm_operations_struct", file: !367, line: 339, flags: DIFlagFwdDecl)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "vm_pgoff", scope: !374, file: !367, line: 342, baseType: !40, size: 64, offset: 1216)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "vm_file", scope: !374, file: !367, line: 344, baseType: !407, size: 64, offset: 1280)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "file", file: !385, line: 525, flags: DIFlagFwdDecl)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "vm_prfile", scope: !374, file: !367, line: 345, baseType: !407, size: 64, offset: 1344)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "vm_private_data", scope: !374, file: !367, line: 346, baseType: !30, size: 64, offset: 1408)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "swap_readahead_info", scope: !374, file: !367, line: 349, baseType: !412, size: 64, offset: 1472)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_long_t", file: !413, line: 12, baseType: !414)
!413 = !DIFile(filename: "include/asm-generic/atomic-long.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic64_t", file: !55, line: 178, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !55, line: 176, size: 64, elements: !416)
!416 = !{!417}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "counter", scope: !415, file: !55, line: 177, baseType: !125, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "vm_policy", scope: !374, file: !367, line: 355, baseType: !419, size: 64, offset: 1536)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_structure_type, name: "mempolicy", file: !367, line: 355, flags: DIFlagFwdDecl)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "vm_userfaultfd_ctx", scope: !374, file: !367, line: 357, baseType: !422, size: 64, offset: 1600)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vm_userfaultfd_ctx", file: !367, line: 279, size: 64, elements: !423)
!423 = !{!424}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !422, file: !367, line: 280, baseType: !425, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "userfaultfd_ctx", file: !367, line: 280, flags: DIFlagFwdDecl)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "mm_rb", scope: !370, file: !367, line: 375, baseType: !293, size: 64, offset: 64)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache_seqnum", scope: !370, file: !367, line: 376, baseType: !25, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "get_unmapped_area", scope: !370, file: !367, line: 378, baseType: !430, size: 64, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!40, !407, !40, !40, !40, !40}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_base", scope: !370, file: !367, line: 382, baseType: !40, size: 64, offset: 256)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_legacy_base", scope: !370, file: !367, line: 383, baseType: !40, size: 64, offset: 320)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_compat_base", scope: !370, file: !367, line: 386, baseType: !40, size: 64, offset: 384)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_compat_legacy_base", scope: !370, file: !367, line: 387, baseType: !40, size: 64, offset: 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "task_size", scope: !370, file: !367, line: 389, baseType: !40, size: 64, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "highest_vm_end", scope: !370, file: !367, line: 390, baseType: !40, size: 64, offset: 576)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !370, file: !367, line: 391, baseType: !440, size: 64, offset: 640)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgd_t", file: !385, line: 268, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 268, size: 64, elements: !443)
!443 = !{!444}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pgd", scope: !442, file: !385, line: 268, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "pgdval_t", file: !390, line: 18, baseType: !40)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "membarrier_state", scope: !370, file: !367, line: 400, baseType: !54, size: 32, offset: 704)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "mm_users", scope: !370, file: !367, line: 412, baseType: !54, size: 32, offset: 736)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "mm_count", scope: !370, file: !367, line: 421, baseType: !54, size: 32, offset: 768)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "pgtables_bytes", scope: !370, file: !367, line: 424, baseType: !412, size: 64, offset: 832)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "map_count", scope: !370, file: !367, line: 426, baseType: !59, size: 32, offset: 896)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "page_table_lock", scope: !370, file: !367, line: 428, baseType: !452, size: 32, offset: 928)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !228, line: 73, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "spinlock", file: !228, line: 61, size: 32, elements: !454)
!454 = !{!455}
!455 = !DIDerivedType(tag: DW_TAG_member, scope: !453, file: !228, line: 62, baseType: !456, size: 32)
!456 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !453, file: !228, line: 62, size: 32, elements: !457)
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "rlock", scope: !456, file: !228, line: 63, baseType: !229, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "mmap_sem", scope: !370, file: !367, line: 431, baseType: !460, size: 320, offset: 960)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rw_semaphore", file: !461, line: 35, size: 320, elements: !462)
!461 = !DIFile(filename: "include/linux/rwsem.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!462 = !{!463, !464, !465, !470, !471}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !460, file: !461, line: 36, baseType: !412, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !460, file: !461, line: 42, baseType: !412, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "osq", scope: !460, file: !461, line: 44, baseType: !466, size: 32, offset: 128)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "optimistic_spin_queue", file: !467, line: 15, size: 32, elements: !468)
!467 = !DIFile(filename: "include/linux/osq_lock.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!468 = !{!469}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !466, file: !467, line: 20, baseType: !54, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !460, file: !461, line: 46, baseType: !227, size: 32, offset: 160)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !460, file: !461, line: 47, baseType: !102, size: 128, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "mmlist", scope: !370, file: !367, line: 433, baseType: !102, size: 128, offset: 1280)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_rss", scope: !370, file: !367, line: 440, baseType: !40, size: 64, offset: 1408)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "hiwater_vm", scope: !370, file: !367, line: 441, baseType: !40, size: 64, offset: 1472)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "total_vm", scope: !370, file: !367, line: 443, baseType: !40, size: 64, offset: 1536)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "locked_vm", scope: !370, file: !367, line: 444, baseType: !40, size: 64, offset: 1600)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "pinned_vm", scope: !370, file: !367, line: 445, baseType: !414, size: 64, offset: 1664)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "data_vm", scope: !370, file: !367, line: 446, baseType: !40, size: 64, offset: 1728)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "exec_vm", scope: !370, file: !367, line: 447, baseType: !40, size: 64, offset: 1792)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "stack_vm", scope: !370, file: !367, line: 448, baseType: !40, size: 64, offset: 1856)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "def_flags", scope: !370, file: !367, line: 449, baseType: !40, size: 64, offset: 1920)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "arg_lock", scope: !370, file: !367, line: 451, baseType: !452, size: 32, offset: 1984)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "start_code", scope: !370, file: !367, line: 452, baseType: !40, size: 64, offset: 2048)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !370, file: !367, line: 452, baseType: !40, size: 64, offset: 2112)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "start_data", scope: !370, file: !367, line: 452, baseType: !40, size: 64, offset: 2176)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "end_data", scope: !370, file: !367, line: 452, baseType: !40, size: 64, offset: 2240)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "start_brk", scope: !370, file: !367, line: 453, baseType: !40, size: 64, offset: 2304)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "brk", scope: !370, file: !367, line: 453, baseType: !40, size: 64, offset: 2368)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "start_stack", scope: !370, file: !367, line: 453, baseType: !40, size: 64, offset: 2432)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "arg_start", scope: !370, file: !367, line: 454, baseType: !40, size: 64, offset: 2496)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "arg_end", scope: !370, file: !367, line: 454, baseType: !40, size: 64, offset: 2560)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "env_start", scope: !370, file: !367, line: 454, baseType: !40, size: 64, offset: 2624)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "env_end", scope: !370, file: !367, line: 454, baseType: !40, size: 64, offset: 2688)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "saved_auxv", scope: !370, file: !367, line: 456, baseType: !495, size: 2944, offset: 2752)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 2944, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 46)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !370, file: !367, line: 462, baseType: !499, size: 256, offset: 5696)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mm_rss_stat", file: !500, line: 60, size: 256, elements: !501)
!500 = !DIFile(filename: "include/linux/mm_types_task.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!501 = !{!502}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !499, file: !500, line: 61, baseType: !503, size: 256)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 256, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 4)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "binfmt", scope: !370, file: !367, line: 464, baseType: !507, size: 64, offset: 5952)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DICompositeType(tag: DW_TAG_structure_type, name: "linux_binfmt", file: !367, line: 464, flags: DIFlagFwdDecl)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !370, file: !367, line: 467, baseType: !510, size: 1088, offset: 6016)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "mm_context_t", file: !511, line: 57, baseType: !512)
!511 = !DIFile(filename: "./arch/x86/include/asm/mmu.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 13, size: 1088, elements: !513)
!513 = !{!514, !515, !516, !517, !520, !521, !529, !530, !534, !535, !536, !540}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_id", scope: !512, file: !511, line: 18, baseType: !25, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_gen", scope: !512, file: !511, line: 28, baseType: !414, size: 64, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ldt_usr_sem", scope: !512, file: !511, line: 31, baseType: !460, size: 320, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ldt", scope: !512, file: !511, line: 32, baseType: !518, size: 64, offset: 448)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "ldt_struct", file: !511, line: 32, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ia32_compat", scope: !512, file: !511, line: 37, baseType: !177, size: 16, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !512, file: !511, line: 40, baseType: !522, size: 256, offset: 576)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mutex", file: !523, line: 53, size: 256, elements: !524)
!523 = !DIFile(filename: "include/linux/mutex.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!524 = !{!525, !526, !527, !528}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !522, file: !523, line: 54, baseType: !412, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "wait_lock", scope: !522, file: !523, line: 55, baseType: !452, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "osq", scope: !522, file: !523, line: 57, baseType: !466, size: 32, offset: 96)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "wait_list", scope: !522, file: !523, line: 59, baseType: !102, size: 128, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "vdso", scope: !512, file: !511, line: 41, baseType: !30, size: 64, offset: 832)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "vdso_image", scope: !512, file: !511, line: 42, baseType: !531, size: 64, offset: 896)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!533 = !DICompositeType(tag: DW_TAG_structure_type, name: "vdso_image", file: !511, line: 42, flags: DIFlagFwdDecl)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "perf_rdpmc_allowed", scope: !512, file: !511, line: 44, baseType: !54, size: 32, offset: 960)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "pkey_allocation_map", scope: !512, file: !511, line: 50, baseType: !252, size: 16, offset: 992)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "execute_only_pkey", scope: !512, file: !511, line: 51, baseType: !537, size: 16, offset: 1008)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "s16", file: !26, line: 18, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s16", file: !28, line: 23, baseType: !539)
!539 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "bd_addr", scope: !512, file: !511, line: 55, baseType: !30, size: 64, offset: 1024)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !370, file: !367, line: 469, baseType: !40, size: 64, offset: 7104)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "core_state", scope: !370, file: !367, line: 471, baseType: !543, size: 64, offset: 7168)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_state", file: !367, line: 365, size: 448, elements: !545)
!545 = !{!546, !547, !553}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "nr_threads", scope: !544, file: !367, line: 366, baseType: !54, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "dumper", scope: !544, file: !367, line: 367, baseType: !548, size: 128, offset: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "core_thread", file: !367, line: 360, size: 128, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "task", scope: !548, file: !367, line: 361, baseType: !31, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !548, file: !367, line: 362, baseType: !552, size: 64, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "startup", scope: !544, file: !367, line: 368, baseType: !554, size: 256, offset: 192)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "completion", file: !555, line: 26, size: 256, elements: !556)
!555 = !DIFile(filename: "include/linux/completion.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!556 = !{!557, !558}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !554, file: !555, line: 27, baseType: !7, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "wait", scope: !554, file: !555, line: 28, baseType: !559, size: 192, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "wait_queue_head_t", file: !560, line: 38, baseType: !561)
!560 = !DIFile(filename: "include/linux/wait.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wait_queue_head", file: !560, line: 34, size: 192, elements: !562)
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !561, file: !560, line: 35, baseType: !452, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !561, file: !560, line: 36, baseType: !102, size: 128, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ioctx_lock", scope: !370, file: !367, line: 474, baseType: !452, size: 32, offset: 7232)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "ioctx_table", scope: !370, file: !367, line: 475, baseType: !567, size: 64, offset: 7296)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DICompositeType(tag: DW_TAG_structure_type, name: "kioctx_table", file: !367, line: 371, flags: DIFlagFwdDecl)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !370, file: !367, line: 488, baseType: !31, size: 64, offset: 7360)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "user_ns", scope: !370, file: !367, line: 490, baseType: !571, size: 64, offset: 7424)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DICompositeType(tag: DW_TAG_structure_type, name: "user_namespace", file: !573, line: 18, flags: DIFlagFwdDecl)
!573 = !DIFile(filename: "include/linux/uidgid.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!574 = !DIDerivedType(tag: DW_TAG_member, name: "exe_file", scope: !370, file: !367, line: 493, baseType: !407, size: 64, offset: 7488)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "mmu_notifier_mm", scope: !370, file: !367, line: 495, baseType: !576, size: 64, offset: 7552)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "mmu_notifier_mm", file: !367, line: 495, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "numa_next_scan", scope: !370, file: !367, line: 506, baseType: !40, size: 64, offset: 7616)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "numa_scan_offset", scope: !370, file: !367, line: 509, baseType: !40, size: 64, offset: 7680)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "numa_scan_seq", scope: !370, file: !367, line: 512, baseType: !59, size: 32, offset: 7744)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_flush_pending", scope: !370, file: !367, line: 519, baseType: !54, size: 32, offset: 7776)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "tlb_flush_batched", scope: !370, file: !367, line: 522, baseType: !583, size: 8, offset: 7808)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool", file: !55, line: 30, baseType: !584)
!584 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "uprobes_state", scope: !370, file: !367, line: 524, baseType: !586, size: 64, offset: 7872)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uprobes_state", file: !18, line: 101, size: 64, elements: !587)
!587 = !{!588}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "xol_area", scope: !586, file: !18, line: 102, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "xol_area", file: !18, line: 99, flags: DIFlagFwdDecl)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "hugetlb_usage", scope: !370, file: !367, line: 526, baseType: !412, size: 64, offset: 7936)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "async_put_work", scope: !370, file: !367, line: 528, baseType: !593, size: 256, offset: 8000)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "work_struct", file: !594, line: 102, size: 256, elements: !595)
!594 = !DIFile(filename: "include/linux/workqueue.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!595 = !{!596, !597, !598}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !593, file: !594, line: 103, baseType: !412, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !593, file: !594, line: 104, baseType: !102, size: 128, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !593, file: !594, line: 105, baseType: !599, size: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "work_func_t", file: !594, line: 21, baseType: !600)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !603}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_bitmap", scope: !366, file: !367, line: 535, baseType: !605, offset: 8256)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: -1)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "active_mm", scope: !32, file: !33, line: 728, baseType: !365, size: 64, offset: 16576)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "vmacache", scope: !32, file: !33, line: 731, baseType: !610, size: 320, offset: 16640)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vmacache", file: !500, line: 34, size: 320, elements: !611)
!611 = !{!612, !613}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "seqnum", scope: !610, file: !500, line: 35, baseType: !25, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "vmas", scope: !610, file: !500, line: 36, baseType: !614, size: 256, offset: 64)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 256, elements: !504)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "rss_stat", scope: !32, file: !33, line: 734, baseType: !616, size: 160, offset: 16960)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "task_rss_stat", file: !500, line: 54, size: 160, elements: !617)
!617 = !{!618, !619}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !616, file: !500, line: 55, baseType: !59, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !616, file: !500, line: 56, baseType: !620, size: 128, offset: 32)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 128, elements: !504)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "exit_state", scope: !32, file: !33, line: 736, baseType: !59, size: 32, offset: 17120)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "exit_code", scope: !32, file: !33, line: 737, baseType: !59, size: 32, offset: 17152)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "exit_signal", scope: !32, file: !33, line: 738, baseType: !59, size: 32, offset: 17184)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "pdeath_signal", scope: !32, file: !33, line: 740, baseType: !59, size: 32, offset: 17216)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "jobctl", scope: !32, file: !33, line: 742, baseType: !40, size: 64, offset: 17280)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !32, file: !33, line: 745, baseType: !7, size: 32, offset: 17344)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "sched_reset_on_fork", scope: !32, file: !33, line: 748, baseType: !7, size: 1, offset: 17376, flags: DIFlagBitField, extraData: i64 17376)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "sched_contributes_to_load", scope: !32, file: !33, line: 749, baseType: !7, size: 1, offset: 17377, flags: DIFlagBitField, extraData: i64 17376)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "sched_migrated", scope: !32, file: !33, line: 750, baseType: !7, size: 1, offset: 17378, flags: DIFlagBitField, extraData: i64 17376)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "sched_remote_wakeup", scope: !32, file: !33, line: 751, baseType: !7, size: 1, offset: 17379, flags: DIFlagBitField, extraData: i64 17376)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "sched_psi_wake_requeue", scope: !32, file: !33, line: 753, baseType: !7, size: 1, offset: 17380, flags: DIFlagBitField, extraData: i64 17376)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "in_execve", scope: !32, file: !33, line: 762, baseType: !7, size: 1, offset: 17408, flags: DIFlagBitField, extraData: i64 17408)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "in_iowait", scope: !32, file: !33, line: 763, baseType: !7, size: 1, offset: 17409, flags: DIFlagBitField, extraData: i64 17408)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "restore_sigmask", scope: !32, file: !33, line: 765, baseType: !7, size: 1, offset: 17410, flags: DIFlagBitField, extraData: i64 17408)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "in_user_fault", scope: !32, file: !33, line: 768, baseType: !7, size: 1, offset: 17411, flags: DIFlagBitField, extraData: i64 17408)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "no_cgroup_migration", scope: !32, file: !33, line: 775, baseType: !7, size: 1, offset: 17412, flags: DIFlagBitField, extraData: i64 17408)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "frozen", scope: !32, file: !33, line: 777, baseType: !7, size: 1, offset: 17413, flags: DIFlagBitField, extraData: i64 17408)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "use_memdelay", scope: !32, file: !33, line: 781, baseType: !7, size: 1, offset: 17414, flags: DIFlagBitField, extraData: i64 17408)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "atomic_flags", scope: !32, file: !33, line: 784, baseType: !40, size: 64, offset: 17472)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "restart_block", scope: !32, file: !33, line: 786, baseType: !641, size: 384, offset: 17536)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "restart_block", file: !12, line: 25, size: 384, elements: !642)
!642 = !{!643, !648}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !641, file: !12, line: 26, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!46, !647}
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, scope: !641, file: !12, line: 27, baseType: !649, size: 320, offset: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !641, file: !12, line: 27, size: 320, elements: !650)
!650 = !{!651, !661, !688}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !649, file: !12, line: 36, baseType: !652, size: 320)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !649, file: !12, line: 29, size: 320, elements: !653)
!653 = !{!654, !656, !657, !658, !659, !660}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr", scope: !652, file: !12, line: 30, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !652, file: !12, line: 31, baseType: !42, size: 32, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !652, file: !12, line: 32, baseType: !42, size: 32, offset: 96)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "bitset", scope: !652, file: !12, line: 33, baseType: !42, size: 32, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !652, file: !12, line: 34, baseType: !25, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "uaddr2", scope: !652, file: !12, line: 35, baseType: !655, size: 64, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "nanosleep", scope: !649, file: !12, line: 46, baseType: !662, size: 192)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !649, file: !12, line: 38, size: 192, elements: !663)
!663 = !{!664, !665, !666, !687}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "clockid", scope: !662, file: !12, line: 39, baseType: !276, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !662, file: !12, line: 40, baseType: !11, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, scope: !662, file: !12, line: 41, baseType: !667, size: 64, offset: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !662, file: !12, line: 41, size: 64, elements: !668)
!668 = !{!669, !677}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "rmtp", scope: !667, file: !12, line: 42, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__kernel_timespec", file: !672, line: 7, size: 128, elements: !673)
!672 = !DIFile(filename: "./include/uapi/linux/time_types.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!673 = !{!674, !676}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !671, file: !672, line: 8, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_time64_t", file: !278, line: 90, baseType: !127)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !671, file: !672, line: 9, baseType: !127, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "compat_rmtp", scope: !667, file: !12, line: 43, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "old_timespec32", file: !680, line: 19, size: 64, elements: !681)
!680 = !DIFile(filename: "include/linux/time32.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!681 = !{!682, !686}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !679, file: !680, line: 20, baseType: !683, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "old_time32_t", file: !680, line: 17, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "s32", file: !26, line: 20, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !28, line: 26, baseType: !59)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !679, file: !680, line: 21, baseType: !684, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "expires", scope: !662, file: !12, line: 45, baseType: !25, size: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "poll", scope: !649, file: !12, line: 54, baseType: !689, size: 256)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !649, file: !12, line: 48, size: 256, elements: !690)
!690 = !{!691, !694, !695, !696, !697}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ufds", scope: !689, file: !12, line: 49, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !12, line: 14, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "nfds", scope: !689, file: !12, line: 50, baseType: !59, size: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "has_timeout", scope: !689, file: !12, line: 51, baseType: !59, size: 32, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !689, file: !12, line: 52, baseType: !40, size: 64, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !689, file: !12, line: 53, baseType: !40, size: 64, offset: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !32, file: !33, line: 788, baseType: !699, size: 32, offset: 17920)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !55, line: 22, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_pid_t", file: !278, line: 28, baseType: !59)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tgid", scope: !32, file: !33, line: 789, baseType: !699, size: 32, offset: 17952)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "stack_canary", scope: !32, file: !33, line: 793, baseType: !40, size: 64, offset: 17984)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "real_parent", scope: !32, file: !33, line: 802, baseType: !31, size: 64, offset: 18048)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !32, file: !33, line: 805, baseType: !31, size: 64, offset: 18112)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !32, file: !33, line: 810, baseType: !102, size: 128, offset: 18176)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "sibling", scope: !32, file: !33, line: 811, baseType: !102, size: 128, offset: 18304)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "group_leader", scope: !32, file: !33, line: 812, baseType: !31, size: 64, offset: 18432)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "ptraced", scope: !32, file: !33, line: 820, baseType: !102, size: 128, offset: 18496)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ptrace_entry", scope: !32, file: !33, line: 821, baseType: !102, size: 128, offset: 18624)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pid", scope: !32, file: !33, line: 824, baseType: !711, size: 64, offset: 18752)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pid", file: !713, line: 59, size: 768, elements: !714)
!713 = !DIFile(filename: "include/linux/pid.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!714 = !{!715, !716, !717, !719, !720, !729}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !712, file: !713, line: 61, baseType: !49, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !712, file: !713, line: 62, baseType: !7, size: 32, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "tasks", scope: !712, file: !713, line: 64, baseType: !718, size: 256, offset: 64)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 256, elements: !504)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "wait_pidfd", scope: !712, file: !713, line: 66, baseType: !559, size: 192, offset: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "rcu", scope: !712, file: !713, line: 67, baseType: !721, size: 128, align: 64, offset: 512)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_head", file: !55, line: 219, size: 128, align: 64, elements: !722)
!722 = !{!723, !725}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !721, file: !55, line: 220, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !721, file: !55, line: 221, baseType: !726, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !724}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "numbers", scope: !712, file: !713, line: 68, baseType: !730, size: 128, offset: 640)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 128, elements: !737)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "upid", file: !713, line: 54, size: 128, elements: !732)
!732 = !{!733, !734}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "nr", scope: !731, file: !713, line: 55, baseType: !59, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ns", scope: !731, file: !713, line: 56, baseType: !735, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "pid_namespace", file: !713, line: 56, flags: DIFlagFwdDecl)
!737 = !{!738}
!738 = !DISubrange(count: 1)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "pid_links", scope: !32, file: !33, line: 825, baseType: !740, size: 512, offset: 18816)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 512, elements: !504)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "thread_group", scope: !32, file: !33, line: 826, baseType: !102, size: 128, offset: 19328)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "thread_node", scope: !32, file: !33, line: 827, baseType: !102, size: 128, offset: 19456)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "vfork_done", scope: !32, file: !33, line: 829, baseType: !744, size: 64, offset: 19584)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "set_child_tid", scope: !32, file: !33, line: 832, baseType: !746, size: 64, offset: 19648)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "clear_child_tid", scope: !32, file: !33, line: 835, baseType: !746, size: 64, offset: 19712)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !32, file: !33, line: 837, baseType: !25, size: 64, offset: 19776)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !32, file: !33, line: 838, baseType: !25, size: 64, offset: 19840)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "gtime", scope: !32, file: !33, line: 843, baseType: !25, size: 64, offset: 19904)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cputime", scope: !32, file: !33, line: 844, baseType: !752, size: 192, offset: 19968)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "prev_cputime", file: !33, line: 242, size: 192, elements: !753)
!753 = !{!754, !755, !756}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "utime", scope: !752, file: !33, line: 244, baseType: !25, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "stime", scope: !752, file: !33, line: 245, baseType: !25, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !752, file: !33, line: 246, baseType: !227, size: 32, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "nvcsw", scope: !32, file: !33, line: 853, baseType: !40, size: 64, offset: 20160)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "nivcsw", scope: !32, file: !33, line: 854, baseType: !40, size: 64, offset: 20224)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !32, file: !33, line: 857, baseType: !25, size: 64, offset: 20288)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "real_start_time", scope: !32, file: !33, line: 860, baseType: !25, size: 64, offset: 20352)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "min_flt", scope: !32, file: !33, line: 863, baseType: !40, size: 64, offset: 20416)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "maj_flt", scope: !32, file: !33, line: 864, baseType: !40, size: 64, offset: 20480)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "posix_cputimers", scope: !32, file: !33, line: 867, baseType: !764, size: 640, offset: 20544)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimers", file: !765, line: 122, size: 640, elements: !766)
!765 = !DIFile(filename: "include/linux/posix-timers.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!766 = !{!767, !775, !776}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "bases", scope: !764, file: !765, line: 123, baseType: !768, size: 576)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 576, elements: !773)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "posix_cputimer_base", file: !765, line: 107, size: 192, elements: !770)
!770 = !{!771, !772}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "nextevt", scope: !769, file: !765, line: 108, baseType: !25, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "tqhead", scope: !769, file: !765, line: 109, baseType: !287, size: 128, offset: 64)
!773 = !{!774}
!774 = !DISubrange(count: 3)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "timers_active", scope: !764, file: !765, line: 124, baseType: !7, size: 32, offset: 576)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_active", scope: !764, file: !765, line: 125, baseType: !7, size: 32, offset: 608)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ptracer_cred", scope: !32, file: !33, line: 872, baseType: !778, size: 64, offset: 21184)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "cred", file: !33, line: 872, flags: DIFlagFwdDecl)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "real_cred", scope: !32, file: !33, line: 875, baseType: !778, size: 64, offset: 21248)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "cred", scope: !32, file: !33, line: 878, baseType: !778, size: 64, offset: 21312)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "cached_requested_key", scope: !32, file: !33, line: 882, baseType: !784, size: 64, offset: 21376)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "key", file: !33, line: 882, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "comm", scope: !32, file: !33, line: 892, baseType: !787, size: 128, offset: 21440)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !788, size: 128, elements: !789)
!788 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!789 = !{!790}
!790 = !DISubrange(count: 16)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "nameidata", scope: !32, file: !33, line: 894, baseType: !792, size: 64, offset: 21568)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "nameidata", file: !33, line: 46, flags: DIFlagFwdDecl)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "sysvsem", scope: !32, file: !33, line: 897, baseType: !795, size: 64, offset: 21632)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysv_sem", file: !796, line: 12, size: 64, elements: !797)
!796 = !DIFile(filename: "include/linux/sem.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!797 = !{!798}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "undo_list", scope: !795, file: !796, line: 13, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "sem_undo_list", file: !796, line: 8, flags: DIFlagFwdDecl)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "sysvshm", scope: !32, file: !33, line: 898, baseType: !802, size: 128, offset: 21696)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sysv_shm", file: !803, line: 13, size: 128, elements: !804)
!803 = !DIFile(filename: "include/linux/shm.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!804 = !{!805}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "shm_clist", scope: !802, file: !803, line: 14, baseType: !102, size: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "last_switch_count", scope: !32, file: !33, line: 901, baseType: !40, size: 64, offset: 21824)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "last_switch_time", scope: !32, file: !33, line: 902, baseType: !40, size: 64, offset: 21888)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !32, file: !33, line: 905, baseType: !809, size: 64, offset: 21952)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "fs_struct", file: !33, line: 42, flags: DIFlagFwdDecl)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !32, file: !33, line: 908, baseType: !812, size: 64, offset: 22016)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "files_struct", file: !33, line: 908, flags: DIFlagFwdDecl)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "nsproxy", scope: !32, file: !33, line: 911, baseType: !815, size: 64, offset: 22080)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DICompositeType(tag: DW_TAG_structure_type, name: "nsproxy", file: !33, line: 47, flags: DIFlagFwdDecl)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !32, file: !33, line: 914, baseType: !818, size: 64, offset: 22144)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "signal_struct", file: !765, line: 206, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "sighand", scope: !32, file: !33, line: 915, baseType: !821, size: 64, offset: 22208)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "sighand_struct", file: !33, line: 59, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "blocked", scope: !32, file: !33, line: 916, baseType: !824, size: 64, offset: 22272)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !825, line: 25, baseType: !826)
!825 = !DIFile(filename: "./arch/x86/include/asm/signal.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !825, line: 23, size: 64, elements: !827)
!827 = !{!828}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !826, file: !825, line: 24, baseType: !829, size: 64)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 64, elements: !737)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "real_blocked", scope: !32, file: !33, line: 917, baseType: !824, size: 64, offset: 22336)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "saved_sigmask", scope: !32, file: !33, line: 919, baseType: !824, size: 64, offset: 22400)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !32, file: !33, line: 920, baseType: !833, size: 192, offset: 22464)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigpending", file: !834, line: 30, size: 192, elements: !835)
!834 = !DIFile(filename: "include/linux/signal_types.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !833, file: !834, line: 31, baseType: !102, size: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !833, file: !834, line: 32, baseType: !824, size: 64, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_sp", scope: !32, file: !33, line: 921, baseType: !40, size: 64, offset: 22656)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_size", scope: !32, file: !33, line: 922, baseType: !840, size: 64, offset: 22720)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !55, line: 55, baseType: !841)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_size_t", file: !278, line: 72, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_ulong_t", file: !278, line: 16, baseType: !40)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "sas_ss_flags", scope: !32, file: !33, line: 923, baseType: !7, size: 32, offset: 22784)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "task_works", scope: !32, file: !33, line: 925, baseType: !724, size: 64, offset: 22848)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "audit_context", scope: !32, file: !33, line: 929, baseType: !846, size: 64, offset: 22912)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "audit_context", file: !33, line: 36, flags: DIFlagFwdDecl)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "loginuid", scope: !32, file: !33, line: 931, baseType: !849, size: 32, offset: 22976)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "kuid_t", file: !573, line: 23, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 21, size: 32, elements: !851)
!851 = !{!852}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !850, file: !573, line: 22, baseType: !853, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !55, line: 32, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "__kernel_uid32_t", file: !278, line: 49, baseType: !7)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sessionid", scope: !32, file: !33, line: 932, baseType: !7, size: 32, offset: 23008)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "seccomp", scope: !32, file: !33, line: 934, baseType: !857, size: 128, offset: 23040)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp", file: !858, line: 29, size: 128, elements: !859)
!858 = !DIFile(filename: "include/linux/seccomp.h", directory: "/usr/src/linux-headers-5.4.0-107-generic")
!859 = !{!860, !861}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !857, file: !858, line: 30, baseType: !59, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !857, file: !858, line: 31, baseType: !862, size: 64, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DICompositeType(tag: DW_TAG_structure_type, name: "seccomp_filter", file: !858, line: 17, flags: DIFlagFwdDecl)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "parent_exec_id", scope: !32, file: !33, line: 937, baseType: !25, size: 64, offset: 23168)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "self_exec_id", scope: !32, file: !33, line: 938, baseType: !25, size: 64, offset: 23232)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_lock", scope: !32, file: !33, line: 941, baseType: !452, size: 32, offset: 23296)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "pi_lock", scope: !32, file: !33, line: 944, baseType: !227, size: 32, offset: 23328)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "wake_q", scope: !32, file: !33, line: 946, baseType: !869, size: 64, offset: 23360)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wake_q_node", file: !33, line: 620, size: 64, elements: !870)
!870 = !{!871}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !869, file: !33, line: 621, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pi_waiters", scope: !32, file: !33, line: 950, baseType: !290, size: 128, offset: 23424)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "pi_top_task", scope: !32, file: !33, line: 952, baseType: !31, size: 64, offset: 23552)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "pi_blocked_on", scope: !32, file: !33, line: 954, baseType: !876, size: 64, offset: 23616)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "rt_mutex_waiter", file: !33, line: 954, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "journal_info", scope: !32, file: !33, line: 995, baseType: !30, size: 64, offset: 23680)
